In [27]:
import country_converter as coco 
import pandas as pd 
import numpy as np

In [28]:
df = pd.read_csv('./aged_15plus_unemployment_rate_percent.csv')
df.head()

,country,1947,1948,1949,1950,1951,1952,1953,1954,1955,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Aruba,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,8.90,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,1.69,NaN,7.91,NaN,NaN,11.2,NaN,NaN,11.7
2,Angola,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,7.36,NaN,NaN,9.58,NaN,NaN,NaN,NaN,NaN,NaN
3,Anguilla,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Albania,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,13.50,13.40,15.9,18.10,17.2,15.4,13.6,12.3,11.5,NaN

In [29]:
cc = coco.CountryConverter()
iso3_code = cc.pandas_convert(series=df['country'], to='ISO3')
iso3_code

Netherlands Antilles not found in regex
UAE not found in ISO3

0      ABW
1      AFG
2      AGO
3      AIA
4      ALB
      ...
217    WSM
218    YEM
219    ZAF
220    ZMB
221    ZWE
Name: country, Length: 222, dtype: object

In [30]:
df['iso'] = iso3_code
df.head()

,country,1947,1948,1949,1950,1951,1952,1953,1954,1955,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,iso
0,Aruba,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,ABW
1,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1.69,NaN,7.91,NaN,NaN,11.2,NaN,NaN,11.7,AFG
2,Angola,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,9.58,NaN,NaN,NaN,NaN,NaN,NaN,AGO
3,Anguilla,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,AIA
4,Albania,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,13.40,15.9,18.10,17.2,15.4,13.6,12.3,11.5,NaN,ALB

In [31]:
df.loc[df['country'].str.contains('UAE'), 'iso'] = 'ARE'

In [32]:
df.loc[df['country'].str.contains('Netherlands Antilles'), 'iso'] = 'ANT'

In [33]:
df.loc[df['country'].str.contains('UAE')]

,country,1947,1948,1949,1950,1951,1952,1953,1954,1955,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,iso
6,UAE,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1.64,2.46,NaN,2.23,NaN,ARE

In [34]:
col_names = list(df.columns)
col_names.remove('country')
col_names.remove('iso')
col_names

['1947',
 '1948',
 '1949',
 '1950',
 '1951',
 '1952',
 '1953',
 '1954',
 '1955',
 '1956',
 '1957',
 '1958',
 '1959',
 '1960',
 '1961',
 '1962',
 '1963',
 '1964',
 '1965',
 '1966',
 '1967',
 '1968',
 '1969',
 '1970',
 '1971',
 '1972',
 '1973',
 '1974',
 '1975',
 '1976',
 '1977',
 '1978',
 '1979',
 '1980',
 '1981',
 '1982',
 '1983',
 '1984',
 '1985',
 '1986',
 '1987',
 '1988',
 '1989',
 '1990',
 '1991',
 '1992',
 '1993',
 '1994',
 '1995',
 '1996',
 '1997',
 '1998',
 '1999',
 '2000',
 '2001',
 '2002',
 '2003',
 '2004',
 '2005',
 '2006',
 '2007',
 '2008',
 '2009',
 '2010',
 '2011',
 '2012',
 '2013',
 '2014',
 '2015',
 '2016',
 '2017',
 '2018',
 '2019',
 '2020']

In [35]:

df = pd.melt(df, id_vars=['country', 'iso'], value_vars=col_names)
df.head()

       country  iso variable  value
0        Aruba  ABW     1947    NaN
1  Afghanistan  AFG     1947    NaN
2       Angola  AGO     1947    NaN
3     Anguilla  AIA     1947    NaN
4      Albania  ALB     1947    NaN

In [36]:

df = df.rename(columns={'variable': 'year', 'value': 'unemployment_over15_percent'})
df.shape

(16428, 4)

In [37]:
df.to_csv('./unemployment_over15_percent.csv', index=False)

In [38]:
df = pd.read_csv('./average_daily_income.csv')
df.head()

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2091,2092,2093,2094,2095,2096,2097,2098,2099,2100
0,Afghanistan,1.330,1.330,1.330,1.330,1.330,1.330,1.330,1.330,1.330,...,10.7,10.9,11.2,11.4,11.7,12.0,12.3,12.6,12.8,13.2
1,Angola,0.779,0.781,0.785,0.789,0.791,0.795,0.799,0.802,0.806,...,19.8,20.2,20.6,21.0,21.4,21.9,22.3,22.7,23.2,23.6
2,Albania,0.919,0.921,0.924,0.927,0.929,0.932,0.935,0.937,0.940,...,56.7,57.4,58.0,58.6,59.2,59.8,60.5,61.1,61.7,62.3
3,Andorra,1.880,1.880,1.880,1.890,1.890,1.890,1.900,1.900,1.900,...,87.1,87.4,87.8,88.1,88.4,88.7,89.0,89.3,89.6,89.9
4,UAE,1.650,1.660,1.670,1.670,1.680,1.680,1.690,1.700,1.700,...,102.0,102.0,102.0,102.0,102.0,102.0,102.0,102.0,102.0,103.0

In [39]:
cc = coco.CountryConverter()
iso3_code = cc.pandas_convert(series=df['country'], to='ISO3')
df['iso'] = iso3_code

UAE not found in ISO3

In [40]:
df.loc[df['country'].str.contains('UAE'), 'iso'] = 'ARE'

In [41]:
col_names = list(df.columns)
col_names.remove('country')
col_names.remove('iso')
col_names

['1800',
 '1801',
 '1802',
 '1803',
 '1804',
 '1805',
 '1806',
 '1807',
 '1808',
 '1809',
 '1810',
 '1811',
 '1812',
 '1813',
 '1814',
 '1815',
 '1816',
 '1817',
 '1818',
 '1819',
 '1820',
 '1821',
 '1822',
 '1823',
 '1824',
 '1825',
 '1826',
 '1827',
 '1828',
 '1829',
 '1830',
 '1831',
 '1832',
 '1833',
 '1834',
 '1835',
 '1836',
 '1837',
 '1838',
 '1839',
 '1840',
 '1841',
 '1842',
 '1843',
 '1844',
 '1845',
 '1846',
 '1847',
 '1848',
 '1849',
 '1850',
 '1851',
 '1852',
 '1853',
 '1854',
 '1855',
 '1856',
 '1857',
 '1858',
 '1859',
 '1860',
 '1861',
 '1862',
 '1863',
 '1864',
 '1865',
 '1866',
 '1867',
 '1868',
 '1869',
 '1870',
 '1871',
 '1872',
 '1873',
 '1874',
 '1875',
 '1876',
 '1877',
 '1878',
 '1879',
 '1880',
 '1881',
 '1882',
 '1883',
 '1884',
 '1885',
 '1886',
 '1887',
 '1888',
 '1889',
 '1890',
 '1891',
 '1892',
 '1893',
 '1894',
 '1895',
 '1896',
 '1897',
 '1898',
 '1899',
 '1900',
 '1901',
 '1902',
 '1903',
 '1904',
 '1905',
 '1906',
 '1907',
 '1908',
 '1909',
 '1910',
 '1911',
 '1912',
 '1913',
 '1914',
 '1915',
 '1916',
 '1917',
 '1918',
 '1919',
 '1920',
 '1921',
 '1922',
 '1923',
 '1924',
 '1925',
 '1926',
 '1927',
 '1928',
 '1929',
 '1930',
 '1931',
 '1932',
 '1933',
 '1934',
 '1935',
 '1936',
 '1937',
 '1938',
 '1939',
 '1940',
 '1941',
 '1942',
 '1943',
 '1944',
 '1945',
 '1946',
 '1947',
 '1948',
 '1949',
 '1950',
 '1951',
 '1952',
 '1953',
 '1954',
 '1955',
 '1956',
 '1957',
 '1958',
 '1959',
 '1960',
 '1961',
 '1962',
 '1963',
 '1964',
 '1965',
 '1966',
 '1967',
 '1968',
 '1969',
 '1970',
 '1971',
 '1972',
 '1973',
 '1974',
 '1975',
 '1976',
 '1977',
 '1978',
 '1979',
 '1980',
 '1981',
 '1982',
 '1983',
 '1984',
 '1985',
 '1986',
 '1987',
 '1988',
 '1989',
 '1990',
 '1991',
 '1992',
 '1993',
 '1994',
 '1995',
 '1996',
 '1997',
 '1998',
 '1999',
 '2000',
 '2001',
 '2002',
 '2003',
 '2004',
 '2005',
 '2006',
 '2007',
 '2008',
 '2009',
 '2010',
 '2011',
 '2012',
 '2013',
 '2014',
 '2015',
 '2016',
 '2017',
 '2018',
 '2019',
 '2020',
 '2021',
 '2022',
 '2023',
 '2024',
 '2025',
 '2026',
 '2027',
 '2028',
 '2029',
 '2030',
 '2031',
 '2032',
 '2033',
 '2034',
 '2035',
 '2036',
 '2037',
 '2038',
 '2039',
 '2040',
 '2041',
 '2042',
 '2043',
 '2044',
 '2045',
 '2046',
 '2047',
 '2048',
 '2049',
 '2050',
 '2051',
 '2052',
 '2053',
 '2054',
 '2055',
 '2056',
 '2057',
 '2058',
 '2059',
 '2060',
 '2061',
 '2062',
 '2063',
 '2064',
 '2065',
 '2066',
 '2067',
 '2068',
 '2069',
 '2070',
 '2071',
 '2072',
 '2073',
 '2074',
 '2075',
 '2076',
 '2077',
 '2078',
 '2079',
 '2080',
 '2081',
 '2082',
 '2083',
 '2084',
 '2085',
 '2086',
 '2087',
 '2088',
 '2089',
 '2090',
 '2091',
 '2092',
 '2093',
 '2094',
 '2095',
 '2096',
 '2097',
 '2098',
 '2099',
 '2100']

In [42]:
df = pd.melt(df, id_vars=['country', 'iso'], value_vars=col_names)
df.head()

       country  iso variable  value
0  Afghanistan  AFG     1800  1.330
1       Angola  AGO     1800  0.779
2      Albania  ALB     1800  0.919
3      Andorra  AND     1800  1.880
4          UAE  ARE     1800  1.650

In [43]:
df = df.rename(columns={'variable': 'year', 'value': 'avrg_daily_income'})
print(df.shape)
df.head()

(58695, 4)

       country  iso  year  avrg_daily_income
0  Afghanistan  AFG  1800              1.330
1       Angola  AGO  1800              0.779
2      Albania  ALB  1800              0.919
3      Andorra  AND  1800              1.880
4          UAE  ARE  1800              1.650

In [44]:
df.to_csv('./avrg_daily_income.csv', index=False)

In [45]:
df = pd.read_csv('./cell_phones_per_100_people.csv')
df.head()

,country,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
0,Aruba,0.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,...,135.0,135.0,135.0,NaN,NaN,NaN,132.0,132.0,132.0,NaN
1,Afghanistan,0.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,...,53.3,56.3,58.4,62.4,67.1,59.9,59.8,58.2,56.6,NaN
2,Angola,0.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,...,50.8,51.8,49.4,44.6,44.1,42.5,45.8,43.8,44.4,67.4
3,Albania,0.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,...,128.0,116.0,118.0,117.0,126.0,94.4,91.5,91.4,92.3,97.9
4,Andorra,0.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,...,89.6,92.5,99.4,105.0,109.0,110.0,115.0,103.0,119.0,142.0

In [47]:
cc = coco.CountryConverter()
iso3_code = cc.pandas_convert(series=df['country'], to='ISO3')
df['iso'] = iso3_code

UAE not found in ISO3

In [49]:
df.loc[df['country'].str.contains('UAE'), 'iso'] = 'ARE'
df.head()

,country,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,iso
0,Aruba,0.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,...,135.0,135.0,NaN,NaN,NaN,132.0,132.0,132.0,NaN,ABW
1,Afghanistan,0.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,...,56.3,58.4,62.4,67.1,59.9,59.8,58.2,56.6,NaN,AFG
2,Angola,0.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,...,51.8,49.4,44.6,44.1,42.5,45.8,43.8,44.4,67.4,AGO
3,Albania,0.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,...,116.0,118.0,117.0,126.0,94.4,91.5,91.4,92.3,97.9,ALB
4,Andorra,0.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,...,92.5,99.4,105.0,109.0,110.0,115.0,103.0,119.0,142.0,AND

In [50]:
col_names = list(df.columns)
col_names.remove('country')
col_names.remove('iso')
col_names

['1960',
 '1961',
 '1962',
 '1963',
 '1964',
 '1965',
 '1966',
 '1967',
 '1968',
 '1969',
 '1970',
 '1971',
 '1972',
 '1973',
 '1974',
 '1975',
 '1976',
 '1977',
 '1978',
 '1979',
 '1980',
 '1981',
 '1982',
 '1983',
 '1984',
 '1985',
 '1986',
 '1987',
 '1988',
 '1989',
 '1990',
 '1991',
 '1992',
 '1993',
 '1994',
 '1995',
 '1996',
 '1997',
 '1998',
 '1999',
 '2000',
 '2001',
 '2002',
 '2003',
 '2004',
 '2005',
 '2006',
 '2007',
 '2008',
 '2009',
 '2010',
 '2011',
 '2012',
 '2013',
 '2014',
 '2015',
 '2016',
 '2017',
 '2018',
 '2019',
 '2020',
 '2021',
 '2022']

In [51]:
df = pd.melt(df, id_vars=['country', 'iso'], value_vars=col_names)
df.head()

       country  iso variable value
0        Aruba  ABW     1960   0.0
1  Afghanistan  AFG     1960   0.0
2       Angola  AGO     1960   0.0
3      Albania  ALB     1960   0.0
4      Andorra  AND     1960   0.0

In [52]:
df = df.rename(columns={'variable': 'year', 'value': 'cellphone_per_100'})
print(df.shape)
df.head()

(13482, 4)

       country  iso  year cellphone_per_100
0        Aruba  ABW  1960               0.0
1  Afghanistan  AFG  1960               0.0
2       Angola  AGO  1960               0.0
3      Albania  ALB  1960               0.0
4      Andorra  AND  1960               0.0

In [53]:
df.to_csv('./cellphone_per_100.csv', index=False)